In [3]:
# brodcasting

import pandas as pd

nba=pd.read_csv('nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,NaN,5000000.0

In [17]:
# adding Salary to column 500000
nba['Salary'].add(500000)
nba["Salary"]+500000

0      8230337.0
1      7296117.0
2            NaN
3      1648640.0
4      5500000.0
         ...
452    2739800.0
453    2933333.0
454    1400000.0
455    3400000.0
456    1447276.0
Name: Salary, Length: 457, dtype: float64

In [21]:
# adding 5 in age 
nba["Age"].add(5)
nba["Age"]+5

0      30
1      30
2      32
3      27
4      34
       ..
452    25
453    31
454    29
455    31
456    31
Name: Age, Length: 457, dtype: int64

In [24]:
# subtracting 500000 from salary
nba['Salary'].sub(500000)
nba['Salary'] - 500000

0      7230337.0
1      6296117.0
2            NaN
3       648640.0
4      4500000.0
         ...
452    1739800.0
453    1933333.0
454     400000.0
455    2400000.0
456     447276.0
Name: Salary, Length: 457, dtype: float64

In [26]:
nba["Weight"].mul(0.453)
nba["Weight"] * 0.453

0       81.540
1      106.455
2       92.865
3       83.805
4      104.643
        ...
452    106.002
453     91.959
454     81.087
455    115.968
456    104.643
Name: Weight, Length: 457, dtype: float64

In [31]:
# adding new column and perfoming operation

nba["Weight in kg"] = nba["Weight"] * 0.453592

nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Weight in kg
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0,81.646560
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0,106.594120
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,NaN,92.986360
3,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State,1148640.0,83.914520
4,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,NaN,5000000.0,104.779752